<!-- add-pr-comment:add-pr-comment -->

## Terraform auth0 (operations-engineering-test) plan
```
auth0_tenant.tenant: Refreshing state... [id=356f7392-d013-479e-a184-4dd1237568c8]
auth0_resource_server.auth0_management_api: Refreshing state... [id=65942c8d2208302c27c666f4]
auth0_attack_protection.attack_protection: Refreshing state... [id=38c317cd-592f-4110-81b1-8c10ccdabbce]
auth0_client.default_app: Refreshing state... [id=qkvVnu0b4pXd6FdEbjm073w4MchhpOoB]
auth0_connection.google_oauth2: Refreshing state... [id=con_yyrB18AQbSUcMLTm]
auth0_client.terraform_provider_auth0: Refreshing state... [id=xI46sB1af7TKeycQ3xfTA2qIxeLiX2R8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # auth0_connection.google_workspace will be created
  + resource "auth0_connection" "google_workspace" {
      + id                   = (known after apply)
      + is_domain_connection = false
      + name                 = "Google"
      + realms               = (known after apply)
      + show_as_button       = true
      + strategy             = "google-apps"

      + options {
          + allowed_audiences        = (known after apply)
          + api_enable_users         = true
          + authorization_endpoint   = (known after apply)
          + client_id                = (sensitive value)
          + client_secret            = (sensitive value)
          + domain                   = "digital.justice.gov.uk"
          + domain_aliases           = (known after apply)
          + ips                      = (known after apply)
          + issuer                   = (known after apply)
          + jwks_uri                 = (known after apply)
          + map_user_id_to_id        = (known after apply)
          + non_persistent_attrs     = (known after apply)
          + password_policy          = (known after apply)
          + scopes                   = [
              + "basic_profile",
              + "ext_profile",
            ]
          + set_user_root_attributes = "on_each_login"
          + sign_in_endpoint         = (known after apply)
          + sign_out_endpoint        = (known after apply)
          + signing_cert             = (known after apply)
          + strategy_version         = (known after apply)
          + tenant_domain            = "digital.justice.gov.uk"
          + token_endpoint           = (known after apply)
          + upstream_params          = jsonencode(
                {
                  + screen_name = {
                      + alias = "login_hint"
                    }
                }
            )
          + userinfo_endpoint        = (known after apply)
        }
    }

  # auth0_connection_client.google_workspace_github will be created
  + resource "auth0_connection_client" "google_workspace_github" {
      + client_id     = (sensitive value)
      + connection_id = (known after apply)
      + id            = (known after apply)
      + name          = (known after apply)
      + strategy      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```